<a href="https://colab.research.google.com/github/lblogan14/python_data_analysis/blob/master/Chapter5_pandas_reading_writing_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Preparation

In [8]:
import numpy as np
import pandas as pd

/bin/bash: conda: command not found

Mount the Google Drive to the Colab Notebook

In [2]:
from google.colab import drive
drive.mount('/content/drive') #add drive content to the notebook

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
'''Shell commands in Linux must have a ! or % in front of them before executing
    referring to the IPython Notebook fashtion'''
!pwd
!ls
%cd
# !cd didn't work, must use %cd

In [11]:
'''Locate the directory which has the dataset'''
%cd /content/drive/My' 'Drive/Colab' 'Notebooks/Python_Data_Analysis/data

/content/drive/My Drive/Colab Notebooks/Python_Data_Analysis/data

##I/O API Tools

>Readers | Writers
>--- | ---
>read_csv | to_csv
>read_excel | to_excel
>read_hdf | to_hdf
>read_sql | to_sql
>read_json | to_json
>read_html | to_html
>read_stata | to_stata
>read_clipboard | to_clipboard
>read_pickle | to_pickle
>read_msgpack | to_msgpack
>read_gpq | to_gbq

#Reading Data in CSV or Text Files

**read_csv()** can read csv file and convert into dataframe object

In [4]:
csvframe = pd.read_csv('ch05_01.csv')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

**read_table()** needs to specify the delimiter

In [26]:
pd.read_table('ch05_01.csv', sep= ',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In the general case, the tabulated data begin directly in the first line, as shown below:

In [5]:
pd.read_csv('ch05_02.csv')
'''See the first row of data... Should not be the header'''

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

This happened because pandas, by default, assigned the first row as the column names.

To avoid this, set the **header** option to **None**

In [6]:
pd.read_csv('ch05_02.csv', header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

You can specify names by assigning a list of labels to the **names** option

In [7]:
pd.read_csv('ch05_02.csv', names=['white','red','blue','green','animal'])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

For DataFrame with a hierarchical structure, you can use **index_col** option

In [8]:
pd.read_csv('ch05_03.csv')

   color status  item1  item2  item3
0  black     up      3      4      6
1  black   down      2      6      7
2  white     up      5      5      5
3  white   down      3      3      2
4  white   left      1      2      1
5    red     up      2      2      2
6    red   down      1      1      4

In [10]:
'''in this way, you can add names on the hierarchical indexes'''
pd.read_csv('ch05_03.csv', index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

#Using RegExp to Parse TXT Files

In addition to comma separators, you may also use other metacharacters to parse the data. Then when you read data using **read_table()**, you can use **sep** option to get rid of the separator.

>RegExp | Metachracters
>--- | ---
> . | Single character, except newline
> \d | Digit
> \D | Non-digit character
> \s | Whitespace character
> \S | Non-whitespace character
> \n | New line character
> \t | Tab character
> \uxxxx | Unicode character specified by the hexadecimal number xxxx


For example, you can use **read_table()** from txt file separated by tabs and random spaces:

In [11]:
pd.read_table('ch05_04.txt', sep='\s+', engine='python')

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

You can extract the numeric part from a TXT file

Remember to set the **header** option to **None** whenever the column headings are not present in the TXT file

In [12]:
pd.read_table('ch05_05.txt', sep= '\D+', header= None, engine='python')

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

You can also exclude all the lines you want using the**skiprows** option

**NOTE:** 

**skiprows = 5** means to skip first five rows

**skiprows = [5]** means to skip the fifth row

In [15]:
pd.read_table('ch05_06.txt', sep= ',', skiprows = [0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

#Reading TXT Files into Parts

when large files are processed, you may want to read the files into chunks

In [16]:
pd.read_csv('ch05_02.csv', header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [17]:
pd.read_csv('ch05_02.csv', header=None, skiprows=[2], nrows=3)

   0  1  2  3     4
0  1  5  2  3   cat
1  2  7  8  5   dog
2  2  2  8  3  duck

Thus, **skiprows** eliminates row 2, and **nrows** limits to only read 3 rows at a time

#Writing Data in CSV

using **to_csv()** function

In [0]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index = ['red', 'blue', 'yellow', 'white'],
                     columns = ['ball', 'pen', 'pencil', 'paper'])
frame.to_csv('ch05_07.csv')

You can exclude the indexes and column names by setting the **index** and the **header** options to **False**

In [0]:
frame.to_csv('ch05_07b.csv', index=False, header=False)

**NaN** values present in the data structure are shown as empty fields in the file

In [20]:
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],
                       [np.nan,np.nan,np.nan,np.nan,np.nan],
                       [np.nan,np.nan,np.nan,np.nan,np.nan],
                       [20,np.nan,np.nan,20.0,np.nan],
                       [19,np.nan,np.nan,19.0,np.nan]
                      ],
                      index=['blue','green','red','white','yellow'],
                      columns=['ball','mug','paper','pen','pencil'])
frame3

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [0]:
frame3.to_csv('ch05_08.csv')

You can replace this empty field with a value to your preference using **na_rep** option in the **to_csv** function

Common values may be **NULL**, 0, or the same **NaN**.

In [0]:
frame3.to_csv('ch05_09.csv', na_rep= 'NaN')

#Reading and Writing HTML Files



*   read_html()
*   to_html()

##Writing Data in HTML

In [24]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))
frame

   0  1
0  0  1
1  2  3

In [25]:
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

As you can see, the whole structure formed by the HTML tags was generated correctly

A more complex dataframe:

In [26]:
frame = pd.DataFrame( np.random.random((4,4)),
                     index = ['white','black','red','blue'],
                     columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.197187  0.169803  0.954916  0.008316
black  0.904224  0.680605  0.224795  0.760523
red    0.773613  0.843729  0.280071  0.742896
blue   0.126257  0.439807  0.035712  0.113072

In [27]:
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>up</th>
      <th>down</th>
      <th>right</th>
      <th>left</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>white</th>
      <td>0.197187</td>
      <td>0.169803</td>
      <td>0.954916</td>
      <td>0.008316</td>
    </tr>
    <tr>
      <th>black</th>
      <td>0.904224</td>
      <td>0.680605</td>
      <td>0.224795</td>
      <td>0.760523</td>
    </tr>
    <tr>
      <th>red</th>
      <td>0.773613</td>
      <td>0.843729</td>
      <td>0.280071</td>
      <td>0.742896</td>
    </tr>
    <tr>
      <th>blue</th>
      <td>0.126257</td>
      <td>0.439807</td>
      <td>0.035712</td>
      <td>0.113072</td>
    </tr>
  </tbody>
</table>

Now write a HTML page through the generation of a string

In [0]:
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')
html = ''.join(s)

All the listing of the HTML page is contained within the *html* variable, now you can write the file called *myFrame.html*

In [0]:
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

##Reading Data from an HTML File

In [12]:
!pip3 install lxml
!pip3 install html5lib

Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (4.2.5)
Requirement already satisfied: html5lib in /usr/local/lib/python3.6/dist-packages (1.0.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from html5lib) (1.11.0)
Requirement already satisfied: webencodings in /usr/local/lib/python3.6/dist-packages (from html5lib) (0.5.1)

In [0]:
web_frames = pd.read_html('myFrame.html')
web_frames[0]

#Reading and Writing Data on Excel

In [16]:
!pip3 install xlrd

Requirement already satisfied: xlrd in /usr/local/lib/python3.6/dist-packages (1.1.0)

In [17]:
pd.read_excel('ch05_data.xlsx')

   white  red  green  black
a     12   23     17     18
b     22   16     19     18
c     14   23     22     21

The spreadsheet file may contain multiple sheets. To access other sheets, need to specify the name of the seet or the index of the sheet as the second argument

In [19]:
pd.read_excel('ch05_data.xlsx', 'Sheet2')

   yellow  purple  blue  orange
A      11      16    44      22
B      20      22    23      44
C      30      31    37      32

In [20]:
pd.read_excel('ch05_data.xlsx', 1)

   yellow  purple  blue  orange
A      11      16    44      22
B      20      22    23      44
C      30      31    37      32

In [21]:
frame = pd.DataFrame(np.random.random((4,4)),
                     index = ['exp1','exp2','exp3','exp4'],
                     columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
frame

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.482958  0.296226  0.505991  0.268109
exp2  0.578975  0.282237  0.560707  0.760179
exp3  0.909191  0.396138  0.644919  0.902040
exp4  0.314069  0.109031  0.335018  0.677995

In [23]:
!pip3 install openpyxl

Collecting openpyxl
  Downloading https://files.pythonhosted.org/packages/e5/0a/e0a095149a23cedd9c8db6cdde2af7f82105e219e14edea0c31a19aeff9e/openpyxl-2.5.8.tar.gz (1.9MB)
    100% |████████████████████████████████| 2.0MB 8.5MB/s
Collecting jdcal (from openpyxl)
  Downloading https://files.pythonhosted.org/packages/a0/38/dcf83532480f25284f3ef13f8ed63e03c58a65c9d3ba2a6a894ed9497207/jdcal-1.4-py2.py3-none-any.whl
Collecting et_xmlfile (from openpyxl)
  Downloading https://files.pythonhosted.org/packages/22/28/a99c42aea746e18382ad9fb36f64c1c1f04216f41797f2f0fa567da11388/et_xmlfile-1.0.1.tar.gz
Building wheels for collected packages: openpyxl, et-xmlfile
  Running setup.py bdist_wheel for openpyxl ... - \ | done
  Stored in directory: /root/.cache/pip/wheels/3f/37/28/5ab3dffb7ff261e6fa21455ec9d157f95958e818c6b89f024c
  Running setup.py bdist_wheel for et-xmlfile ... - done
  Stored in directory: /root/.cache/pip/wheels/2a/77/35/0da0965a057698121fc7d8c5a7a9955cdbfb3cc4e2423cad39
Successfully built openpyxl et-xmlfile
Installing collected packages: jdcal, et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.0.1 jdcal-1.4 openpyxl-2.5.8

In [0]:
frame.to_excel('data2.xlsx')

#JSON Data
JSON = Javascript Object Notation

Use **to_json()** to write a json file

In [0]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=['white','black','red','blue'],
                     columns=['up','down','right','left'])
frame.to_json('frame.json')

In [27]:
frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

Use **read_json()** to read a json file

In [26]:
pd.read_json('frame.json')

       down  left  right  up
black     5     7      6   4
blue     13    15     14  12
red       9    11     10   8
white     1     3      2   0

JSON files do not have a tabular structure so you need to convert the structure *dict*  file into tabular form, called *normalization*

This work can be done using **json_normalize()** function, but you need to import first.

**json_normalize()** can convert a *dict* or a list in a table

In [0]:
from pandas.io.json import json_normalize

Since the book.json file structure is no longer tabular, but more complex. **read_json()** is no longer valid. 

To have a structured tabular data, you have to load the contents of the JSON file and convert it into a string

In [0]:
import json
file = open('books.json','r')
text = file.read()
text = json.loads(text)

As an example, if you want to extract a table taht contains all the books, then write the *books* key as the second argument

In [30]:
json_normalize(text, 'books') # books <- key

   price                title
0  23.56         XML Cookbook
1  50.70  Python Fundamentals
2  12.30    The NumPy library
3  28.60      Java Enterprise
4  31.35                HTML5
5  28.00   Python for Dummies

To add other keys, you can add other columns by inserting a key list as the third argument

In [31]:
json_normalize(text, 'books', ['nationality', 'writer'])

   price                title nationality           writer
0  23.56         XML Cookbook         USA        Mark Ross
1  50.70  Python Fundamentals         USA        Mark Ross
2  12.30    The NumPy library         USA        Mark Ross
3  28.60      Java Enterprise          UK  Barbara Bracket
4  31.35                HTML5          UK  Barbara Bracket
5  28.00   Python for Dummies          UK  Barbara Bracket

#The Format HDF5
HDF = hierarchical data format

**h5py** provides a direct interface with the high-level APIs HDF5

**PyTables** makes abstract many of the details of HDF5 to provide more flexible data container..

pandas has a class-like *dict* called **HDFStore**, using **PyTables** to store pandas objects.

Need to import the **HDFStore** class

In [38]:
!pip3 install tables

Collecting tables
  Downloading https://files.pythonhosted.org/packages/d7/1b/21f4c7f296b718575c17ef25e61c05742a283c45077b4c8d5a190b3e0b59/tables-3.4.4-cp36-cp36m-manylinux1_x86_64.whl (3.8MB)
    100% |████████████████████████████████| 3.8MB 6.2MB/s
Requirement already satisfied: numpy>=1.8.0 in /usr/local/lib/python3.6/dist-packages (from tables) (1.14.6)
Requirement already satisfied: six>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from tables) (1.11.0)
Collecting numexpr>=2.5.2 (from tables)
  Downloading https://files.pythonhosted.org/packages/db/ea/efd9e16283637eb5b6c0042b6cc3521f1b9a5b47767ac463c88bbd37670c/numexpr-2.6.8-cp36-cp36m-manylinux1_x86_64.whl (162kB)
    100% |████████████████████████████████| 163kB 27.9MB/s
Installing collected packages: numexpr, tables
Successfully installed numexpr-2.6.8 tables-3.4.4

In [0]:
from pandas.io.pytables import HDFStore

Create a dataframe

In [0]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=['white','black','red','blue'],
                     columns=['up','down','right','left'])

Create a file HDF5 calling it *mydata.h5*, then enter the data inside of the dataframe

In [0]:
store = HDFStore('mydata.h5')
store['obj1'] = frame

You can store multiple data structures within the same HDF5 file

In [40]:
frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [0]:
store['obj2'] = frame

In [42]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

#Pickle -- Python Object Serialization
**pickle** module

**cPickle** module

##Serialize a Python Object with cPickle

In [0]:
import pickle #or cPickle

In [43]:
data = {'color':['white','red'], 'value':[5,7]}
data

{'color': ['white', 'red'], 'value': [5, 7]}

serialization of the *data* object through the **dumps()** function

In [0]:
pickled_data = pickle.dumps(data)

In [47]:
print(pickled_data)

b'\x80\x03}q\x00(X\x05\x00\x00\x00colorq\x01]q\x02(X\x05\x00\x00\x00whiteq\x03X\x03\x00\x00\x00redq\x04eX\x05\x00\x00\x00valueq\x05]q\x06(K\x05K\x07eu.'

deserialization with the **loads()** function

In [48]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

##Pickling with pandas
To save a pickled file in pandas structure, just use **to_pickle()**

In [0]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=['white','black','red','blue'])
frame.to_pickle('frame.pkl')

To open a PKL file,

In [50]:
pd.read_pickle('frame.pkl')

        0   1   2   3
white   0   1   2   3
black   4   5   6   7
red     8   9  10  11
blue   12  13  14  15

#Interacting with Databases
The **pandas.io.sql** module provides a unified interface, called **sqlalchemy**, which simplifies the connection mode.

To make a connection, you use the **create_engine()** function, which you can configure all the properties necessary to use the driver, as a user, password, port, and database instance.

In [56]:
!pip3 install SQLAlchemy

Collecting SQLAlchemy
  Downloading https://files.pythonhosted.org/packages/25/c9/b0552098cee325425a61efdf380c51b5c721e459081c85bbb860f501c091/SQLAlchemy-1.2.12.tar.gz (5.6MB)
    100% |████████████████████████████████| 5.6MB 4.6MB/s
Building wheels for collected packages: SQLAlchemy
  Running setup.py bdist_wheel for SQLAlchemy ... - \ | / - \ | / done
  Stored in directory: /root/.cache/pip/wheels/ed/bd/2e/d3874a6e97b8cc71e7e177c8d065ead30f67f380c4d9bbadaa
Successfully built SQLAlchemy
Installing collected packages: SQLAlchemy
Successfully installed SQLAlchemy-1.2.12

In [0]:
from sqlalchemy import create_engine

For PostgreSQL,

In [0]:
engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')

For MySQL,

In [0]:
engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

For Oracle,

In [0]:
engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')

For MSSQL,

In [0]:
engine = create_engine('mssql+pyodbc://mydsn')

For SQLite,

In [0]:
engine = create_engine('sqlite:///foo.db')

##Loading and Writing Data with SQLite3

In [58]:
frame = pd.DataFrame( np.arange(20).reshape(4,5),
                     columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

Implement the connection to the SQLite3 database

In [0]:
engine = create_engine('sqlite:///foo.db')

Convert the dataframe in a table within the database

In [0]:
frame.to_sql('colors', engine)

Use **read_sql()** function with the name and the engine to read the database

In [61]:
pd.read_sql('colors',engine)

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19